azhel12/Zhele/include/zhele/platform/stm32/h5/i2c.h
/**
 * @file
 * Implement i2c protocol for stm32h5 series
 *
 * @author Alexey Zhelonkin
 * @date 2026
 * @license MIT
 */

#ifndef ZHELE_PLATFORM_STM32_H5_I2C_H
#define ZHELE_PLATFORM_STM32_H5_I2C_H

#include <stm32h5xx.h>

#include "../common/i2c.h"

#include "clock.h"
#include "dma.h"
#include "iopins.h"

#include <array>
#include <cstdint>
#include <type_traits>

namespace Zhele
{
    namespace Private
    {
        I2C_TEMPLATE_ARGS
        template<unsigned sclPinNumber, unsigned sdaPinNumber>
        void I2C_TEMPLATE_QUALIFIER::SelectPins()
        {
            using SclPin = typename _SclPins::io_pins::template Pin<sclPinNumber>;
            SclPin::Port::Enable();
            SclPin::template SetConfiguration<SclPin::Port::Configuration::AltFunc>();
            SclPin::template AltFuncNumber<_SclPins::alt_functions[sclPinNumber]>();
            SclPin::SetDriverType(SclPin::Port::DriverType::OpenDrain);
            SclPin::SetPullMode(SclPin::PullMode::PullUp);

            using SdaPin = typename _SdaPins::io_pins::template Pin<sdaPinNumber>;
            if constexpr (!std::is_same_v<typename SdaPin::Port, typename SclPin::Port>)
            {
                SdaPin::Port::Enable();
            }
            SdaPin::template SetConfiguration<SdaPin::Port::Configuration::AltFunc>();
            SdaPin::template AltFuncNumber<_SdaPins::alt_functions[sdaPinNumber]>();
            SdaPin::SetDriverType(SdaPin::Port::DriverType::OpenDrain);
            SdaPin::SetPullMode(SdaPin::PullMode::PullUp);
        }

        I2C_TEMPLATE_ARGS
        void I2C_TEMPLATE_QUALIFIER::SelectPins(uint8_t sclPinNumber, uint8_t sdaPinNumber)
        {
            using SclPins = typename _SclPins::io_pins;
            using SdaPins = typename _SdaPins::io_pins;

            using Type = typename SclPins::DataType;

            SclPins::Enable();
            Type maskScl(1 << sclPinNumber);
            SclPins::SetConfiguration(SclPins::Configuration::AltFunc, maskScl);
            SclPins::AltFuncNumber(_SclPins::alt_functions[sclPinNumber], maskScl);
            SclPins::SetDriverType(SclPins::DriverType::OpenDrain, maskScl);
            SclPins::SetPullMode(SclPins::PullMode::PullUp, maskScl);

            SdaPins::Enable();
            Type maskSda(1 << sdaPinNumber);
            SdaPins::SetConfiguration(SdaPins::Configuration::AltFunc, maskSda);
            SdaPins::AltFuncNumber(_SdaPins::alt_functions[sdaPinNumber], maskSda);
            SdaPins::SetDriverType(SdaPins::DriverType::OpenDrain, maskSda);
            SdaPins::SetPullMode(SdaPins::PullMode::PullUp, maskSda);
        }

        I2C_TEMPLATE_ARGS
        template<typename SclPin, typename SdaPin>
        void I2C_TEMPLATE_QUALIFIER::SelectPins()
        {
            const int sclPinIndex = _SclPins::io_pins:: template IndexOf<SclPin>;
            const int sdaPinIndex = _SdaPins::io_pins:: template IndexOf<SdaPin>;

            static_assert(sclPinIndex >= 0);
            static_assert(sdaPinIndex >= 0);

            SelectPins<sclPinIndex, sdaPinIndex>();
        }

        struct I2c1SclPins
        {
            using io_pins = IO::PinList<IO::Pb6, IO::Pb8, IO::Pc8>;
            static constexpr std::array<uint8_t, 3> alt_functions{4, 4, 4};
        };
        struct I2c1SdaPins
        {
            using io_pins = IO::PinList<IO::Pb5, IO::Pb7, IO::Pb10, IO::Pc9>;
            static constexpr std::array<uint8_t, 4> alt_functions{11, 4, 11, 4};
        };

        struct I2c2SclPins
        {
            using io_pins = IO::PinList<IO::Pb3, IO::Pb5, IO::Pb10, IO::Pc6, IO::Pc10>;
            static constexpr std::array<uint8_t, 5> alt_functions{8, 8, 4, 8, 8};
        };
        struct I2c2SdaPins
        {
            using io_pins = IO::PinList<IO::Pb3, IO::Pb4, IO::Pb8, IO::Pb13, IO::Pc7, IO::Pc11>;
            static constexpr std::array<uint8_t, 6> alt_functions{4, 8, 8, 4, 8, 8};
        };

        IO_STRUCT_WRAPPER(I2C1, I2c1Regs, I2C_TypeDef);
    #if defined (I2C2)
        IO_STRUCT_WRAPPER(I2C2, I2c2Regs, I2C_TypeDef);
    #endif
    }

    template<typename _DmaTx = void, typename _DmaRx = void>
    using I2c1 = Private::I2cBase<Private::I2c1Regs, I2C1_EV_IRQn, I2C1_ER_IRQn, Clock::I2c1Clock, Private::I2c1SclPins, Private::I2c1SdaPins, _DmaTx, _DmaRx>;
    using I2c1NoDma = I2c1<>;

#if defined (I2C2)
    template<typename _DmaTx = void, typename _DmaRx = void>
    using I2c2 = Private::I2cBase<Private::I2c2Regs, I2C2_EV_IRQn, I2C2_ER_IRQn, Clock::I2c2Clock, Private::I2c2SclPins, Private::I2c2SdaPins, _DmaTx, _DmaRx>;
    using I2c2NoDma = I2c2<>;
#endif
}

#endif //! ZHELE_PLATFORM_STM32_H5_I2C_H
